{{--

    ஏன் Interface தேவை?
    -------------------------
        HomeController இந்த Interface-ஐ மட்டுமே பார்க்கும். Database மாறினாலும் (MySQL → MongoDB) Controller-ல் ஒரு வரிகூட மாற வேண்டியதில்லை. Concrete class (Implementation) மட்டும் மாறும்.

    ------------------------------------------------------------------------------------
    Enum = fixed values list (change ஆகாத constant values collection)
    ----
        👉 Role values எல்லாம் ஒரே இடத்தில் define பண்ணலாம்
        ✔️ இதனால்: typo error வராது ❌ (admn, adminn)

        ❌ Without Enum - typo error ❌ - duplicate strings ❌ - maintain panna kashtam ❌
    ------------------------------------------------------------------------------------
    ------------------------------------------------------------------------------------
    ------------------------------------------------------------------------------------
    ------------------------------------------------------------------------------------













--}}
